In [1]:
# dataframe的创建方式
# 导入库
import numpy as np
import pandas as pd

# 通过Series创建
s1=pd.Series([1,2,3,4,5])
s2=pd.Series([6,7,8,9,10])
df=pd.DataFrame({'第一列：':s1,'第二列：':s2})
df

   第一列：  第二列：
0     1     6
1     2     7
2     3     8
3     4     9
4     5    10

In [2]:
# 通过字典创建
df=pd.DataFrame(
    {
        'name':['jk','qq','xx','smz','pite'],
        'age':[12,23,26,24,13],
        'scores':[78,56,87.5,90,100]
    },index=[1,2,3,4,5],columns=['name','scores','age']
)
df

   name  scores  age
1    jk    78.0   12
2    qq    56.0   23
3    xx    87.5   26
4   smz    90.0   24
5  pite   100.0   13

In [3]:
# dataframe的属性
print('行索引：',df.index) # 行索引 index
print('列标签：',df.columns) #列标签 columns
print('值：',df.values) # 获取值 values 返回的是一个二维数组

行索引： Index([1, 2, 3, 4, 5], dtype='int64')
列标签： Index(['name', 'scores', 'age'], dtype='object')
值： [['jk' 78.0 12]
 ['qq' 56.0 23]
 ['xx' 87.5 26]
 ['smz' 90.0 24]
 ['pite' 100.0 13]]

In [4]:
print(f'维度：{df.ndim} 维') # 维度 ndim
print(f'形状：{df.shape}') # 形状 shape
print(f'元素个数：{df.size}') # 元素个数 size
print(f'数据类型：\n{df.dtypes}') # 数据类型 dtypes

维度：2 维
形状：(5, 3)
元素个数：15
数据类型：
name       object
scores    float64
age         int64
dtype: object

In [5]:
# 行列转置
df.T # 转置之后，行索引和列标签同时改变 T

           1     2     3     4      5
name      jk    qq    xx   smz   pite
scores  78.0  56.0  87.5  90.0  100.0
age       12    23    26    24     13

In [6]:
# 获取元素
print(df)
print('='*20)
print(df.loc[3]) # 显式索引 支持切片 闭区间
print('='*20)
print(df.iloc[2]) # 隐式索引 支持切片 左开右闭

   name  scores  age
1    jk    78.0   12
2    qq    56.0   23
3    xx    87.5   26
4   smz    90.0   24
5  pite   100.0   13
====================
name        xx
scores    87.5
age         26
Name: 3, dtype: object
====================
name        xx
scores    87.5
age         26
Name: 3, dtype: object

In [8]:
# 获取单个元素
print(df.at[2,'name']) # 依旧显式 at[] 获取单个值，不支持切片
print(df.iat[1,0]) # 依旧隐式 iat[] 同样不支持切片

qq
qq

In [14]:
# 获取单列数据
print(df['name'])
print(type(df['name']))
print('='*20)
print(df.name)
print(type(df.name))

1      jk
2      qq
3      xx
4     smz
5    pite
Name: name, dtype: object
<class 'pandas.core.series.Series'>
====================
1      jk
2      qq
3      xx
4     smz
5    pite
Name: name, dtype: object
<class 'pandas.core.series.Series'>

In [17]:
# 获取多列数据
print(df[['name','scores']])

   name  scores
1    jk    78.0
2    qq    56.0
3    xx    87.5
4   smz    90.0
5  pite   100.0

In [20]:
# 查看多列数据
df.head(3)

  name  scores  age
1   jk    78.0   12
2   qq    56.0   23
3   xx    87.5   26

In [22]:
df.tail(3)

   name  scores  age
3    xx    87.5   26
4   smz    90.0   24
5  pite   100.0   13

In [27]:
# 使用bool索引来进行筛选
df[df.scores>80] # 单个条件

   name  scores  age
3    xx    87.5   26
4   smz    90.0   24
5  pite   100.0   13

In [ ]:
df[(df.scores>70) & (df.age>20)] # 单个条件

  name  scores  age
3   xx    87.5   26
4  smz    90.0   24

In [64]:
# 随机抽样
df.sample(2) # sample 可自定义抽样数量

   name  scores  age
2    qq    56.0   23
5  pite   100.0   13

In [ ]:
# dataframe的常见方法
df.isin(['xx',24]) # 查看元素是否包含在参数集合中 isin()

    name  scores    age
1  False   False  False
2  False   False  False
3   True   False  False
4  False   False   True
5  False   False  False

In [65]:
df.isna() # 查看元素是否是缺失值 isna()

    name  scores    age
1  False   False  False
2  False   False  False
3  False   False  False
4  False   False  False
5  False   False  False

In [ ]:
print(df)
print('='*20)
print(f'总年龄：{df['age'].sum()}') # 求某一列的总和
print(f'总得分：{df['scores'].sum()}')
print(f'最高得分：{df.scores.max()}')
print(f'最小年龄：{df.age.min()}')
print(f'平均分：{df.scores.mean()}')
print(f'年龄中位数：{df.age.median()}')
print(f'分数众数：\n{df.scores.mode()}')

   name  scores  age
1    jk    78.0   12
2    qq    56.0   23
3    xx    87.5   26
4   smz    90.0   24
5  pite   100.0   13
====================
总年龄：98
总得分：411.5
最高得分：100.0
最小年龄：12
平均分：82.3
年龄中位数：23.0
分数众数：
0     56.0
1     78.0
2     87.5
3     90.0
4    100.0
Name: scores, dtype: float64

In [92]:
print(f'分数标准差：{df.scores.std():.4f}')
print(f'分数的方差：{df.scores.var():.4f}')
print(f'分位数：{df.scores.quantile(0.25)}')

分数标准差：16.6568
分数的方差：277.4500
分位数：78.0

In [ ]:
df.describe() # 获取所有的描述性信息

          scores        age
count    5.00000   5.000000
mean    82.30000  19.600000
std     16.65683   6.580274
min     56.00000  12.000000
25%     78.00000  13.000000
50%     87.50000  23.000000
75%     90.00000  24.000000
max    100.00000  26.000000

In [97]:
df.count() # 返回每一列非缺失值的个数

name      5
scores    5
age       5
dtype: int64

In [ ]:
df.value_counts() # 将数据找出来并统计它们出现的次数 默认从高到低排序 自动跳过缺失值

name  scores  age
jk    78.0    12     1
pite  100.0   13     1
qq    56.0    23     1
smz   90.0    24     1
xx    87.5    26     1
Name: count, dtype: int64

In [107]:
df.duplicated(subset=['age']) # 查重 常用参数subset= 只查某列是否重复

1    False
2    False
3    False
4    False
5    False
dtype: bool

In [110]:
df.drop_duplicates() # 去重

   name  scores  age
1    jk    78.0   12
2    qq    56.0   23
3    xx    87.5   26
4   smz    90.0   24
5  pite   100.0   13

In [130]:
# 随机抽样
df.sample(2)

  name  scores  age
2   qq    56.0   23
1   jk    78.0   12

In [139]:
df.replace('pite','bolin') # 替换值

    name  scores  age
1     jk    78.0   12
2     qq    56.0   23
3     xx    87.5   26
4    smz    90.0   24
5  bolin   100.0   13

In [149]:
df.cumsum(axis=0) # 累积和 默认按列累积 可通过axis来改变累积方向

            name  scores  age
1             jk    78.0   12
2           jkqq   134.0   35
3         jkqqxx   221.5   61
4      jkqqxxsmz   311.5   85
5  jkqqxxsmzpite   411.5   98

In [ ]:
df.sort_index(axis=0,ascending=True) 
# 按照索引排序 常用参数 axis=0/1 按行/列索引排序 ascending=Fales 降序 True 升序

   name  scores  age
1    jk    78.0   12
2    qq    56.0   23
3    xx    87.5   26
4   smz    90.0   24
5  pite   100.0   13

In [189]:
df.sort_values(by=['scores','age'],ascending=[True,True])
# 按照值排序 必须指定参数by,by中同时可有多个参数，按照参数顺序排序。当前一个参数中有相同的行时，才会按当前参数排列规则排序 其他参数与 sort_index()一致

   name  scores  age
2    qq    56.0   23
1    jk    78.0   12
3    xx    87.5   26
4   smz    90.0   24
5  pite   100.0   13

In [ ]:
df.nlargest(3,'age') # 本身为降序排序

  name  scores  age
3   xx    87.5   26
4  smz    90.0   24
2   qq    56.0   23

In [196]:
df.nsmallest(3,'scores') # 本身为升序排序

  name  scores  age
2   qq    56.0   23
1   jk    78.0   12
3   xx    87.5   26

## eg1:学生成绩分析
### 某班级的学生成绩如下
### 1.计算每位学生的总分和平均分
### 2.找出数学成绩高于90分或英语成绩高于85的学生
### 3.按总分从高到低排序，并输出前3名学生

In [269]:
import pandas as pd
data={
    '姓名':['张三','李四','王五','赵六','钱七'],
    '数学':[85,92,78,88,95],
    '英语':[90,88,85,92,80],
    '物理':[75,80,88,85,90]
}
data

{'姓名': ['张三', '李四', '王五', '赵六', '钱七'],
 '数学': [85, 92, 78, 88, 95],
 '英语': [90, 88, 85, 92, 80],
 '物理': [75, 80, 88, 85, 90]}

In [270]:
scores=pd.DataFrame(data)
scores

   姓名  数学  英语  物理
0  张三  85  90  75
1  李四  92  88  80
2  王五  78  85  88
3  赵六  88  92  85
4  钱七  95  80  90

In [271]:
# 总分和平均分
scores['总分']=scores[['数学','英语','物理']].sum(axis=1)
scores['平均分']=scores[['数学','英语','物理']].mean(axis=1).round(4)
scores

   姓名  数学  英语  物理   总分      平均分
0  张三  85  90  75  250  83.3333
1  李四  92  88  80  260  86.6667
2  王五  78  85  88  251  83.6667
3  赵六  88  92  85  265  88.3333
4  钱七  95  80  90  265  88.3333

In [272]:
# 2.找出数学成绩高于90分或英语成绩高于85的学生
scores[(scores['数学']>90)|(scores['英语']>85)]

   姓名  数学  英语  物理   总分      平均分
0  张三  85  90  75  250  83.3333
1  李四  92  88  80  260  86.6667
3  赵六  88  92  85  265  88.3333
4  钱七  95  80  90  265  88.3333

In [277]:
# 3.按总分从高到低排序，并输出前3名学生
r1=scores.nlargest(3,'总分')
r1
# r2=scores.sort_values('总分',ascending=False).head(3)
# r2

   姓名  数学  英语  物理   总分      平均分
3  赵六  88  92  85  265  88.3333
4  钱七  95  80  90  265  88.3333
1  李四  92  88  80  260  86.6667

## eg2:销售数据分析
### 某公司销售数据如下
### 1.计算每种产品的总销售额（销售额=单价X销量）
### 2.找出销售额最高的产品
### 3.按销售额从高到低排序，并输出所有产品信息

In [279]:
import pandas as pd
data={
    '产品名称':['A','B','C','D'],
    '单价':[100,150,200,120],
    '销量':[20,30,20,40]
}

In [282]:
df=pd.DataFrame(data)
df

  产品名称   单价  销量
0    A  100  20
1    B  150  30
2    C  200  20
3    D  120  40

In [286]:
# 1.计算每种产品的总销售额（销售额=单价X销量）
df['销售额']=df['单价']*df['销量']
df

  产品名称   单价  销量   销售额
0    A  100  20  2000
1    B  150  30  4500
2    C  200  20  4000
3    D  120  40  4800

In [289]:
# 2.找出销售额最高的产品
df.nlargest(1,'销售额')

  产品名称   单价  销量   销售额
3    D  120  40  4800

In [296]:
# 3.按销售额从高到低排序，并输出所有产品信息
df.sort_values('销售额',ascending=False)

  产品名称   单价  销量   销售额
3    D  120  40  4800
1    B  150  30  4500
2    C  200  20  4000
0    A  100  20  2000

## eg3:电商用户行为分析
### 某电商平台的用户行为数据如下
### 1.计算每位用户的总消费金额（消费金额=商品单价*购买数量）
### 2.找出消费金额最高的用户，并输出其所有信息
### 3.计算所有用户的平均消费金额（保留两位小数）
### 4.统计电子产品的总购买数量

In [298]:
data={
    '用户id':[101,102,103,104,105],
    '用户名':['jk','qq','pt','xx','smz'],
    '商品类别':['电子产品','服饰','电子产品','家居','服饰'],
    '单价':[1200,300,800,150,200],
    '购买数量':[1,3,2,5,4]
}

In [301]:
df=pd.DataFrame(data)
df

   用户id  用户名  商品类别    单价  购买数量
0   101   jk  电子产品  1200     1
1   102   qq    服饰   300     3
2   103   pt  电子产品   800     2
3   104   xx    家居   150     5
4   105  smz    服饰   200     4

In [305]:
# 1.计算每位用户的总消费金额（消费金额=商品单价*购买数量）
df['总消费金额']=df['单价']*df['购买数量']
df

   用户id  用户名  商品类别    单价  购买数量  总消费金额
0   101   jk  电子产品  1200     1   1200
1   102   qq    服饰   300     3    900
2   103   pt  电子产品   800     2   1600
3   104   xx    家居   150     5    750
4   105  smz    服饰   200     4    800

In [307]:
# 2.找出消费金额最高的用户，并输出其所有信息
df.nlargest(1,'总消费金额')

   用户id 用户名  商品类别   单价  购买数量  总消费金额
2   103  pt  电子产品  800     2   1600

In [317]:
# 3.计算所有用户的平均消费金额（保留两位小数）
df['平均消费']=df['总消费金额'].mean().round(2)
df

   用户id  用户名  商品类别    单价  购买数量  总消费金额    平均消费
0   101   jk  电子产品  1200     1   1200  1050.0
1   102   qq    服饰   300     3    900  1050.0
2   103   pt  电子产品   800     2   1600  1050.0
3   104   xx    家居   150     5    750  1050.0
4   105  smz    服饰   200     4    800  1050.0

In [320]:
# 4.统计电子产品的总购买数量
df[df['商品类别']=='电子产品']['购买数量'].sum()

np.int64(3)